#include<bits/stdc++.h>
#include<iostream>
#include<conio.h>//getch()
#include <windows.h>//sleep
//#include<ctime>//随机数 
using namespace std;
void check1(char a[][20])
{
        if(a[6][3]=='O')
            a[6][3]='@';
        if(a[3][6]=='O')
            a[3][6]='@';
        if(a[9][7]=='O')
            a[9][7]='@';
        if(a[6][11]=='O')
            a[6][11]='@';
        if(a[6][3]==' ')
            a[6][3]='*';
        if(a[3][6]==' ')
            a[3][6]='*';
        if(a[9][7]==' ')
            a[9][7]='*';
        if(a[6][11]==' ')
            a[6][11]='*';
}
void check2(char a[][20])
{
        if(a[5][9]=='O')
            a[5][9]='@';
        if(a[6][9]=='O')
            a[6][9]='@';
        if(a[7][9]=='O')
            a[7][9]='@';
        if(a[5][9]==' ')
            a[5][9]='*';
        if(a[6][9]==' ')
            a[6][9]='*';
        if(a[7][9]==' ')
            a[7][9]='*';
}

void first()
{
  system("color 0a");
 
   a:
 
  char a[20][20]={"             ",
                    "             ",
                    "     ###     ",
                    "     #*#     ",
                    "     # #     ",
                    "  ####O######",
                    "  #*  OH O *#",
                    "  #####O#####",
                    "      # #    ",
                    "      #*#    ",
                    "      ###    "};  
    system("cls");
    for(int i=0;i<=12;i++)
        {
            puts(a[i]);
        }
    int x,y;
    x=6,y=7;
    while(1)
    {
        char z;
        z=getch();
        if(z=='w')
        {
            if(a[x-1][y]!='#')
            {
                if(a[x-2][y]!='#'&&a[x-1][y]=='O'&&a[x-2][y]!='O'&&a[x-2][y]!='@')
                {
                    a[x][y]=' ';
                    x--;
                    a[x][y]='H';
                    a[x-1][y]='O';
                }
                else if(a[x-2][y]!='#'&&a[x-1][y]=='@'&&a[x-2][y]!='O'&&a[x-2][y]!='@'&&a[x-2][y]!=' ')
                {
                    a[x][y]=' ';
                    x--;
                    a[x][y]='H';
                    a[x-1][y]='@';
                }
                else if(a[x-2][y]!='#'&&a[x-1][y]=='@'&&a[x-2][y]!='O'&&a[x-2][y]!='@'&&a[x-2][y]==' ')
                {
                    a[x][y]=' ';
                    x--;
                    a[x][y]='H';
                    a[x-1][y]='O';
                }
                else if(a[x-1][y]!='O'&&a[x-1][y]!='@')
                {
                    a[x][y]=' ';
                    x--;
                    a[x][y]='H';
                }
            
            }
        }
        if(z=='a')
        {
            if(a[x][y-1]!='#')
            {
                if(a[x][y-2]!='#'&&a[x][y-1]=='O'&&a[x][y-2]!='O'&&a[x][y-2]!='@')
                {
                    a[x][y]=' ';
                    y--;
                    a[x][y]='H';
                    a[x][y-1]='O';
                }
                else if(a[x][y-2]!='#'&&a[x][y-1]=='@'&&a[x][y-2]!='O'&&a[x][y-2]!='@'&&a[x][y-2]!=' ')
                {
                    a[x][y]=' ';
                    y--;
                    a[x][y]='H';
                    a[x][y-1]='@';
                }
                else if(a[x][y-2]!='#'&&a[x][y-1]=='@'&&a[x][y-2]!='O'&&a[x][y-2]!='@'&&a[x][y-2]==' ')
                {
                    a[x][y]=' ';
                    y--;
                    a[x][y]='H';
                    a[x][y-1]='O';
                }
                else if(a[x][y-1]!='O'&&a[x][y-1]!='@')
                {
                    a[x][y]=' ';
                    y--;
                    a[x][y]='H';
                }
            }
        }
        if(z=='d')
        {
            if(a[x][y+1]!='#')
            {
                if(a[x][y+2]!='#'&&a[x][y+1]=='O'&&a[x][y+2]!='O'&&a[x][y+2]!='@')
                {
                    a[x][y]=' ';
                    y++;
                    a[x][y]='H';
                    a[x][y+1]='O';
                }
                else if(a[x][y+2]!='#'&&a[x][y+1]=='@'&&a[x][y+2]!='@'&&a[x][y+2]!='O'&&a[x][y+2]!=' ')
                {
                    a[x][y]=' ';
                    y++;
                    a[x][y]='H';
                    a[x][y+1]='@';
                }
                else if(a[x][y+2]!='#'&&a[x][y+1]=='@'&&a[x][y+2]!='@'&&a[x][y+2]!='O'&&a[x][y+2]==' ')
                {
                    a[x][y]=' ';
                    y++;
                    a[x][y]='H';
                    a[x][y+1]='O';
                }
                else if(a[x][y+1]!='O'&&a[x][y+1]!='@')
                {
                    a[x][y]=' ';
                    y++;
                    a[x][y]='H';
                }
            }
        }
        if(z=='s')
        {
            if(a[x+1][y]!='#')
            {
                if(a[x+2][y]!='#'&&a[x+1][y]=='O'&&a[x+2][y]!='O'&&a[x+2][y]!='@')
                {
                    a[x][y]=' ';
                    x++;
                    a[x][y]='H';
                    a[x+1][y]='O';
                }
                else if(a[x+2][y]!='#'&&a[x+1][y]=='@'&&a[x+2][y]!='O'&&a[x+2][y]!='@'&&a[x+2][y]!=' ')
                {
                    a[x][y]=' ';
                    x++;
                    a[x][y]='H';
                    a[x+1][y]='@';
                }
                else if(a[x+2][y]!='#'&&a[x+1][y]=='@'&&a[x+2][y]!='O'&&a[x+2][y]!='@'&&a[x+2][y]==' ')
                {
                    a[x][y]=' ';
                    x++;
                    a[x][y]='H';
                    a[x+1][y]='O';
                }
                else if(a[x+1][y]!='O'&&a[x+1][y]!='@')
                {
                    a[x][y]=' ';
                    x++;
                    a[x][y]='H';
                }
            }
        }

		if(z=='r')
            goto a;
            
         check1(a); 
        system("cls");
        for(int i=0;i<=11;i++)
        {
            puts(a[i]);
        }
        if(a[6][3]=='@'&&a[6][11]=='@'&&a[9][7]=='@'&&a[3][6]=='@')
            {Sleep(1500);break;}

	
    


}system("cls");
    cout<<"恭喜，但这只是第一关，继续努力吧";       
    Sleep(3000);
}
void second()
{
	b:
    system("color 2");
    char a[20][20]={"            ",
                    "            ",
                    "  #####     ",
                    "  #H  #     ",
                    "  # OO# ### ",
                    "  # O # #*# ",
                    "  ### ###*# ",
                    "   ##    *# ",
                    "   #   #  # ",
                    "   #   #### ",
                    "   #####    ",};
    system("cls");
    for(int i=0;i<=11;i++)
        {
            puts(a[i]);
        }
    int x,y;
    x=3,y=3;
    while(1)
    {
        char z;
        z=getch();
        if(z=='w')
        {
            if(a[x-1][y]!='#')
            {
                if(a[x-2][y]!='#'&&a[x-1][y]=='O'&&a[x-2][y]!='O'&&a[x-2][y]!='@')
                {
                    a[x][y]=' ';
                    x--;
                    a[x][y]='H';
                    a[x-1][y]='O';
                }
                else if(a[x-2][y]!='#'&&a[x-1][y]=='@'&&a[x-2][y]!='O'&&a[x-2][y]!='@'&&a[x-2][y]!=' ')
                {
                    a[x][y]=' ';
                    x--;
                    a[x][y]='H';
                    a[x-1][y]='@';
                }
                else if(a[x-2][y]!='#'&&a[x-1][y]=='@'&&a[x-2][y]!='O'&&a[x-2][y]!='@'&&a[x-2][y]==' ')
                {
                    a[x][y]=' ';
                    x--;
                    a[x][y]='H';
                    a[x-1][y]='O';
                }
                else if(a[x-1][y]!='O'&&a[x-1][y]!='@')
                {
                    a[x][y]=' ';
                    x--;
                    a[x][y]='H';
                }
                else if(a[x-1][y]=='O'&&a[x-2][y]=='O'&&a[x-3][y]!='#')
                {
                	a[x-3][y]='O';
                	a[x-2][y]=='O';
                	x--;
                	a[x][y]='H';
				}
            }
        }
        if(z=='a')
        {
            if(a[x][y-1]!='#')
            {
                if(a[x][y-2]!='#'&&a[x][y-1]=='O'&&a[x][y-2]!='O'&&a[x][y-2]!='@')
                {
                    a[x][y]=' ';
                    y--;
                    a[x][y]='H';
                    a[x][y-1]='O';
                }
                else if(a[x][y-2]!='#'&&a[x][y-1]=='@'&&a[x][y-2]!='O'&&a[x][y-2]!='@'&&a[x][y-2]!=' ')
                {
                    a[x][y]=' ';
                    y--;
                    a[x][y]='H';
                    a[x][y-1]='@';
                }
                else if(a[x][y-2]!='#'&&a[x][y-1]=='@'&&a[x][y-2]!='O'&&a[x][y-2]!='@'&&a[x][y-2]==' ')
                {
                    a[x][y]=' ';
                    y--;
                    a[x][y]='H';
                    a[x][y-1]='O';
                }
                else if(a[x][y-1]!='O'&&a[x][y-1]!='@')
                {
                    a[x][y]=' ';
                    y--;
                    a[x][y]='H';
                }
            }
        }
        if(z=='d')
        {
            if(a[x][y+1]!='#')
            {
                if(a[x][y+2]!='#'&&a[x][y+1]=='O'&&a[x][y+2]!='O'&&a[x][y+2]!='@')
                {
                    a[x][y]=' ';
                    y++;
                    a[x][y]='H';
                    a[x][y+1]='O';
                }
                else if(a[x][y+2]!='#'&&a[x][y+1]=='@'&&a[x][y+2]!='@'&&a[x][y+2]!='O'&&a[x][y+2]!=' ')
                {
                    a[x][y]=' ';
                    y++;
                    a[x][y]='H';
                    a[x][y+1]='@';
                }
                else if(a[x][y+2]!='#'&&a[x][y+1]=='@'&&a[x][y+2]!='@'&&a[x][y+2]!='O'&&a[x][y+2]==' ')
                {
                    a[x][y]=' ';
                    y++;
                    a[x][y]='H';
                    a[x][y+1]='O';
                }
                else if(a[x][y+1]!='O'&&a[x][y+1]!='@')
                {
                    a[x][y]=' ';
                    y++;
                    a[x][y]='H';
                }
            }
        }
        if(z=='s')
        {
            if(a[x+1][y]!='#')
            {
                if(a[x+2][y]!='#'&&a[x+1][y]=='O'&&a[x+2][y]!='O'&&a[x+2][y]!='@')
                {
                    a[x][y]=' ';
                    x++;
                    a[x][y]='H';
                    a[x+1][y]='O';
                }
                else if(a[x+2][y]!='#'&&a[x+1][y]=='@'&&a[x+2][y]!='O'&&a[x+2][y]!='@'&&a[x+2][y]!=' ')
                {
                    a[x][y]=' ';
                    x++;
                    a[x][y]='H';
                    a[x+1][y]='@';
                }
                else if(a[x+2][y]!='#'&&a[x+1][y]=='@'&&a[x+2][y]!='O'&&a[x+2][y]!='@'&&a[x+2][y]==' ')
                {
                    a[x][y]=' ';
                    x++;
                    a[x][y]='H';
                    a[x+1][y]='O';
                }
                else if(a[x+1][y]!='O'&&a[x+1][y]!='@')
                {
                    a[x][y]=' ';
                    x++;
                    a[x][y]='H';
                }
                else if(a[x+1][y]=='O'&&a[x+2][y]=='O'&&a[x+3][y]!='#')
                {
                	a[x][y]=' ';
                a[x+3][y]='O';
				a[x+2][y]=='O';
				x++;
				a[x][y]='H';	
				}
            }
        }

		if(z=='r')
            goto b;	
        check2(a);
        if(a[5][9]=='@'&&a[6][9]=='@'&&a[7][9]=='@')
            break;
        system("cls");
        for(int i=0;i<=11;i++)
        {
            puts(a[i]);
        }
 }   
        system("cls");
        cout<<"恭喜这是第二关";
		Sleep(3000); 
	

}
int main()
{
    cout<<"\n\n\n\n\n          ******************************************\n\n"
                            <<"                     欢迎来到推箱子\n\n"
                            <<"                     游戏说明：\n"
                            <<"                     请用小写输入法操作，wasd为上下左右移动\n"
                            <<"                     游戏中H为你，O，@为可推动的箱子，\n                     将箱子全部推动到*处即获胜\n"
                            <<"                     作者：计通2215陈康坤\n "
                            <<"                     按任意键继续\n\n"
                            <<"          ******************************************\n";
    getch();
    system("cls");
    first();
    system("cls");
    second();
    
   
    return 0;
}


